def P1(room):
    '''
    room: M x N list, M>=1, N>=1
    '''
    #m
    #n
    #각 value와, 이에 대응하는 좌표들 딕셔너리. 1:[(1,4),(2,5)....]
    #방문 딕셔너리. (좌표), Boolean pair
    #1갯수 계산. while loop에서 1갯수가 증가하지 않으면 break
    # 0 갯수. 나중에 0갯수가 0이 아니면 -1 return
    # m * n 루프
            # 모든 좌표 visited false
            # 각 value(1,0,-1)과 대응하는 좌표 리스트 만들기

            # 1 갯수 더하기
            #0 갯수 더하기
    #while loop가 몇번 돌아갔는지 저장할 변수

    # 1갯수 


        #1만 들어있는 dict.{1:[(3,4),(2,1)...]}
            # 일단 1인 좌표는 다 꺼내기 때문에, 이 중에 아직 방문하지 않은 1을 대상으로 계산
                #해당 루프에서 아직 방문하지 않은 1들
                # 위, 해당 좌표의 위가 0 이면, 1로 바꾸고, 딕셔너리에 좌표 저장, 0-> 1로 바뀌니 0갯수 감소, 1 갯수 증가
                # 아래
                # 왼쪽
                # 오른쪽
        # 만약 1갯수의 변화가 없다면, 루프 멈춤
        # count더함
    #0이 아직 남아있다면 -1 return
    #아니면 그냥
 


